# **isin Methods in Pandas**

---

In [0]:
import pandas as pd

In [0]:
from google.colab import files
upload = files.upload()

Saving employees.csv to employees.csv

In [0]:
df = pd.read_csv('employees.csv', parse_dates = ['Start Date', 'Last Login Time'])

In [0]:
df['Senior Management'] = df['Senior Management'].astype('bool')

In [0]:
df['Gender'] = df['Gender'].astype('category')

In [0]:
df.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male 1993-08-06  ...   6.945               True        Marketing
1     Thomas    Male 1996-03-31  ...   4.170               True              NaN
2      Maria  Female 1993-04-23  ...  11.858              False          Finance
3      Jerry    Male 2005-03-04  ...   9.340               True          Finance
4      Larry    Male 1998-01-24  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [0]:
mask1 = df['Team'] == 'Legal'

In [0]:
mask2 = df['Team'] == 'Sales'

In [0]:
mask3 = df['Team'] == "Product"

In [0]:
df[mask1| mask2| mask3].head()

   First Name  Gender Start Date  ... Bonus %  Senior Management     Team
5      Dennis    Male 1987-04-18  ...  10.125              False    Legal
6        Ruby  Female 1987-08-17  ...  10.012               True  Product
11      Julie  Female 1997-10-26  ...  12.637               True    Legal
13       Gary    Male 2008-01-27  ...   5.831              False    Sales
15    Lillian  Female 2016-06-05  ...   1.256              False  Product

[5 rows x 8 columns]

In [0]:
mask = df['Team'].isin(['Legal','Sales','Product'])

In [0]:
df[mask].head()

   First Name  Gender Start Date  ... Bonus %  Senior Management     Team
5      Dennis    Male 1987-04-18  ...  10.125              False    Legal
6        Ruby  Female 1987-08-17  ...  10.012               True  Product
11      Julie  Female 1997-10-26  ...  12.637               True    Legal
13       Gary    Male 2008-01-27  ...   5.831              False    Sales
15    Lillian  Female 2016-06-05  ...   1.256              False  Product

[5 rows x 8 columns]